---
kind: type
id: T:Autodesk.Revit.DB.HorizontalAlignmentStyle
source: html/389f81df-bc4d-6d65-812d-aa7ca3d3c42a.htm
---
# Autodesk.Revit.DB.HorizontalAlignmentStyle

Declares the horizontal alignment style of font.

## Syntax (C#)
```csharp
public enum HorizontalAlignmentStyle
```